{
  "main": {
    "name":"I'm Nikita Voevodin",
    "description":"Professional data scientist/engineer and full-stack developer at Subaru of America with current concentration in NLP and Big Data architecture. Formerly, Director of Data Engineering & Analytics at the NYC Taxi & Limousine Commission. P.S: If you are interested in learning R, check out my book R, Not the Best Practices (link below).",
    "image":"profilepic.jpg",
    "bio":"Professional data scientist/engineer and full-stack developer at Subaru of America with current concentration in NLP and Big Data architecture. Currently, I am a senior data scientist and engineer at Subaru of America. My work involves building and maintaining cloud infrastructure, developing and automating big data processes, creating AI backed full stack apps and dashboards, as well as conducting high level research to support Subaru business processes.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "voevodin.nv@gmail.com",
    "phone": "718-288-1459",
    "github":"https://github.com/nvoevodin",
    "project":"https://bookdown.org/voevodin_nv/R_Not_the_Best_Practices/",
    "address":{
      "street":"",
      "city":"Brooklyn",
      "state":"New York",
      "zip": ""
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"https://drive.google.com/file/d/1re9ZYGrH8JiKrrrvOPDOU-BbGldACcUI/view?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/profile.php?id=100008286490379",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"http://twitter.com",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/nvoevodin/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/nvoevodin",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"This is my modest evaluation of my own core programming skills. ",
    "education":[
      {
        "school":"Colin Powell School for Civic and Global Leadership (CUNY)",
        "degree":"MPA (Data Analysis)",
        "graduated":"September 2017",
        "description":"GPA: 3.85."
      },
      {
        "school":"Colin Powell School for Civic and Global Leadership (CUNY)",
        "degree":"BA (Political Science)",
        "graduated":"June 2015",
        "description":"GPA: 3.5."
      },
      {
        "school":"Kaliningrad State Technical University",
        "degree":"BS (Economics)",
        "graduated":"June 2011",
        "description":""
      }
    ],
    "work":[
      {
        "company":"Subaru of America",
        "title":"Senior Data Scientist/Engineer",
        "years":"Dec 2022 - Present",
        "description":Led a cloud infrastructure migration project to move the team’s Big Data and compute from Cloudera to AWS Cloud. Set up QA, DEV, and PROD environments, built compute, storage, archiving, networking, and auxiliary infrastructure, as well as refactored majority of the ETL processes from the traditional DB and Apache design to the object storage and serverless medallion patterns using formats like parquet, iceberg, and delta. The project resulted in savings of ~$500k/year. In charge of the AWS Cloud infrastructure, maintain crucial telematics ETL processes, build utility monitoring tables, create users, policies and permission sets. Built and deployed SageMaker docker backed RStudio infrastructure to enable data scientists to spin as much compute as they need. Prototyped built and deployed to production two AI backed full stack applications to parse, classify, and visualize repair claims comments and customer/business correspondences. Six thousand daily comments are now processed, classified, and analyzed in minutes. Used advanced prompt engineering, map-reduce, refine, and model chaining techniques to achieve 90%+ classification accuracy utilizing GPT 4o and GPT 4o-mini in tandem. The apps resulted in an extreme increase in productivity, freeing up two QA teams from doing manual comments parsing. In charge of MS Azure AI Foundry, selecting, deploying, testing, fine-tuning and policing AI models for the advanced analytics team.  In the process of cloud migration to MS Azure for applications, middleware, and API solutions, and Azure hosted DataBricks for advanced analytics and BI."
      },
      {
        "company":"NYC Taxi & Limousine Commission",
        "title":"Director of Data Engineering & Analytics",
        "years":"Apr 2022 - Jan 2023",
        "description":Built from zero and led a team of analysts and engineers to provide Big Data analyses and technical infrastructure to the Policy division of the Taxi & Limousine Commission of NYC. Built a semi-automated management system by using Azure DevOps with active utilization of Agile principles that led to increased efficiency in work distribution, documentation, tracking, and completion. Solved massive delays in SQL query execution times by shifting analytics from an in-house SQL Server to the combination of the OLAP database with locally stored Big Data .parquet files. An average execution time decreased by hundreds of times from hours to seconds. Led the project to expand the frequency and amount of data that TLC releases to the public as part of its Open Data commitment, which resulted in a significant reduction in the Freedom of Information Act (FOIL) requests from the public. Present data analytics and engineering work, research and operational improvements to agency executives, internal and external stakeholders; represent the division and provide expertise and technical consulting services at city agencies’ data sharing and data acquisition discussions and other cross-agency initiatives that involve data. Prepare executive memorandums, presentations, data analysis summary reports, procedure manuals, technical guides, standard operating procedures, and workflow manuals."
      },
      {
        "company":"NYC Taxi & Limousine Commission",
        "title":"Senior Data Engineer (Unit Head)",
        "years":"Sep 2021 - Apr 2022",
        "description":Served as a bridge between the Policy division and IT by providing technical infrastructure for the day-to-day operations of the division by utilizing available resources. Designed and built the State of the Industry set of dashboards to improve internal and external data reporting requirements. Identified inefficiencies and gaps in existing procedures and solved them. Switched TLC’s Open Data AWS files sharing format from .csv to .parquet, implemented CloudFront caching layer with WAF firewall to protect the account from malicious bots and overuse that will lead to $150k of data hosting/sharing savings in the next three years. Designed and built tables, schema, stored procedures, and jobs for a SQL Server-based analytics datawarehouse."
      },
      {
        "company":"NYC Taxi & Limousine Commission",
        "title":"Senior Data Analyst",
        "years":"Oct 2019 - Sep 2021",
        "description":"Script Python, R and SQL queries for data exploration, data validation and ETL procedures. Design, build, and interact with SQL Server, MySQL, PostgreSQL, ClickHouse databases, as well as aggregated warehousing solutions to produce independently requested metrics for senior leadership. Provide complete support and maintain TLC Data Hub and other apps. Research, prototype, and present new ideas to advance the agency’s mission and streamline internal operations. Serve as a liaison for transferring data from TLC to the Mayors Office, other city agencies, as well as media outlets like NYT, WSJ, and New York Post."
      },
      {
        "company":"NYC Taxi & Limousine Commission",
        "title":"Data Analyst",
        "years":"May 2018 - Oct 2019",
        "description":"Created a variety of apps and dashboards with designed and implemented backend database setups for both TLC and public consumption (eg., DataHub, VinDecoder, MeetUp App). Conducted advanced data analyses to assist agency initiatives, such as the Congestion Study and TLC Vehicle Cap. Instituted a bi-weekly data meetup that connected analysts across multiple departments to engage and develop new products."
      },
      {
        "company":"New York State Assembly",
        "title":"Data Analyst",
        "years":"Apr 2016 - Feb 2017",
        "description":"Introduced SQL and Excel into the daily operation of the 72nd district office, which helped automate and streamline most of the data tasks. Successfully distributed $4 million of NYS capital funding and $500,000 of discretional funding to the municipal and non-profit organizations of the 72 Assembly district. Increased submission of legislation proposals by recruiting and supervising a team of interns."
      }
    ],
    "skills":[
      {
        "name":"R",
        "level":"90%"
      },
      {
        "name":"SQL",
        "level":"80%"
      },
      {
        "name":"ReactJs",
        "level":"70%"
      },
      {
        "name":"React-Native",
        "level":"70%"
      },
      {
        "name":"JS",
        "level":"60%"
      },
      {
        "name":"Python",
        "level":"70%"
      },
      {
        "name":"DevOps",
        "level":"60%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"VolleyPal (React-Native)",
        "category":"Social Network for Volleyball Players",
        "image":"01.jpg",
        "url":"https://www.volleypal.site"
      },
      {
        "title":"TLC Data Hub (R-Shiny)",
        "category":"TLC data aggregator",
        "image":"02.jpg",
        "url":"https://tlcanalytics.shinyapps.io/tlc_dash/"
      },
      {
        "title":"Data Meetup (R-Shiny)",
        "category":"TLC Data Meetup scheduler",
        "image":"03.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      },
      {
        "title":"TLC Vin Decoder (R-Shiny)",
        "category":"TLC Vin Decoder",
        "image":"04.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"NaZabore (ReactJS)",
        "category":"Russian urban dictionary.",
        "image":"05.jpg",
        "url":"https://www.nazabore.site"
      },
      {
        "title":"GeoHut (React-Native)",
        "category":"Employee check-in system.",
        "image":"06.jpg",
        "url":"https://play.google.com/store/apps/details?id=com.vcoolstudio.geohut&hl=en_CA&gl=US"
      },
      {
        "title":"DoublePark (React-Native)",
        "category":"Transportation app",
        "image":"07.jpg",
        "url":"https://play.google.com/store/apps/details?id=com.vcoolstudio.doublePark&hl=en_CA&gl=US"
      },
      {
        "title":"Decoder Backend (Python)",
        "category":"Decoder backend",
        "image":"08.jpg",
        "url":"https://github.com/nvoevodin/pyDecoder"
      },
      {
        "title":"MK Sounds (HTML/CSS/JS)",
        "category":"Practice app",
        "image":"09.jpg",
        "url":"https://nvoevodin.github.io/mk_sounds/"
      },
      {
        "title":"Flex Gallery (HTML/CSS)",
        "category":"Practice app",
        "image":"10.jpg",
        "url":"https://nvoevodin.github.io/flex_gal/"
      },
      {
        "title":"Dice Game (HTML/CSS/JS)",
        "category":"Practice game app.",
        "image":"11.jpg",
        "url":"https://nvoevodin.github.io/Pig-Game/"
      },
      {
        "title":"Budgety (HTML/CSS/JS)",
        "category":"Practice App",
        "image":"12.jpg",
        "url":"https://nvoevodin.github.io/budget_app/"
      }
    ]
  }
}
